{
"title":"The Sojourn"
"description":"<![CDATA[ <p>The Tantalus Cluster is the fragile cradle of humanity.</p><p>“The Sojourn is a melange of rich storytelling, superb sound effects, and well-written characters that sound so real it's like you're in the shuttle beside them. There's a lot to enjoy in this immersive, fun audiodrama." (Jeremy Szal)</p><p>“It's my first audiodrama and it sets the bar very high! Really high quality sound effects and talented voice actors bring the story to life like nothing else.” (Matterbeam, ToughSF)</p><p>Adrift in the divide between galaxies and surrounded by the vast emptiness of the intergalactic void, the Tantalus Cluster is the only home humanity has ever known. Desperate and facing starvation, humanity’s only hope is a strange nebula that has suddenly appeared beyond the edge of the cluster. Its shifting clouds may hide a source of salvation for the people of Tantalus, but time is running out.</p><p>Signing on to the ambitious Avalon Expedition, Privateer Captain Cassandra Farren will face the shadows of both the past and future as she leads her small crew into the unknown in a last, desperate bid for the survival of the human race.</p><p>Directed and produced with careful scientific consultation, The Sojourn captures every detail of life aboard ship and features a full cast of veteran voice actors, backed up by high-quality sound effects and an epic original soundtrack.</p><p>Starring Larissa Thompson as Captain Cassandra Farren, Emily Serdahl as Director Elizabeth Ancelet, Laura Faye Smith as Tamara Melari, Ben Prendergast as Mathias Croft, Stephen Trafford as Inquisitor Castian Vadric, also featuring Matthew Kaufman as Lieutenant Jasper Ravi, and Lelia Symington as Empress Valendra the Sixth. Written by Daniel Orrett, Rowan J. Coleman, and Larissa Thompson with sound design by Kennedy Phillips and music by Sam Redfern.</p><p>Transcripts available here: thesojournaudiodrama.com/transcripts</p> ]]>"
"author":"Daniel Orrett"
"image url":"https://content.production.cdn.art19.com/images/ad/2c/aa/94/ad2caa94-bafc-4230-b3e6-32ef122001d1/ee10aaf8b59ae3c08000cb5a6cd3b3f96c90baac180b9f087ef3bfd67e7a57e9b9fdb2b1e029be5ec7290341c703faa5e6ff8da2d3fa8d434125fc788c09bdee.jpeg"
}